{"pageProps":{"source":{"compiledSource":"var c=Object.defineProperty,d=Object.defineProperties;var p=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(e,t,o)=>t in e?c(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,n=(e,t)=>{for(var o in t||(t={}))r.call(t,o)&&l(e,o,t[o]);if(i)for(var o of i(t))s.call(t,o)&&l(e,o,t[o]);return e},h=(e,t)=>d(e,p(t));var u=(e,t)=>{var o={};for(var a in e)r.call(e,a)&&t.indexOf(a)<0&&(o[a]=e[a]);if(e!=null&&i)for(var a of i(e))t.indexOf(a)<0&&s.call(e,a)&&(o[a]=e[a]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var a=o,{components:e}=a,t=u(a,[\"components\"]);return mdx(MDXLayout,h(n(n({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h3\",n({},{id:\"riot-api\"}),mdx(\"a\",n({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#riot-api\"}),mdx(\"span\",n({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Riot API\"),mdx(\"p\",null,`At the beginning of summer, I decided to look more into the dev side of Riot's game (mostly in League of Legends)\nsince I really enjoyed the game, but no one can survive constant gaming on the rift... unless, you are Tyler1, of course.`),mdx(\"p\",null,`Anyways, I wanted to see how popular tools like op.gg, u.gg, and other popular tools were collecting their information. My plan was to\nmimic similar basic information collection (which I ended up doing without too much problem) and use those informations to train and\ndo some simple modeling using sklearn or something similar to predict game outcomes.`),mdx(\"p\",null,`The Riot APIs were pretty straight forward to use thanks to their dev portal that allows you to test API calls\neasily without setting anything up. However, I did end up running into performance issues in collecting and parsing the information\nfor the input players and storing the data as a method of cacheing for the future. I could always speed this up by just scraping the\nwebsite such as opgg which already stores numerous player data already, but I haven't had the chance to tackle the modeling and\ncalculation (which I actually I look forward to doing once I get some time on it) So I will come back to that once I do have some more time.`),mdx(\"p\",null,\"In the mean time, I will probably try to contribute to more well established league prediction projects such as \",mdx(\"a\",n({parentName:\"p\"},{href:\"https://github.com/JohnsonJDDJ/zilean\"}),\"zilean\"),`\n(although it's a different method than what I was going for but in a similar directions), and include some cool things I found while interacting with Riot API here in the future.\n(I am talking about stuff like how they call Wukong as 'monkeyking' in their json data and etc, but idk if I will update them all here :/)`),mdx(\"p\",null,\"Go back \",mdx(\"a\",n({parentName:\"p\"},{href:\"/\"}),\"Home\"),\".\"))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"Riot","description":"Rambling about random things","date":"2021-05-29"}},"frontMatter":{"title":"Riot","description":"Rambling about random things","date":"2021-05-29"}},"__N_SSG":true}